//Автор: Кожевников Андрей
//Задача 136л https://ivtipm.github.io/Programming/Glava06/index06.htm#z136

#include <iostream>
#include <random>
#include <time.h>

using namespace std;


int main(){
    size_t n = 0;
    cout << "Введите натуральное число n: ";
    cin >> n;
    //Создание динамического массива
    float *array = new float[n];

}
